Repository: wcslauri-lgtm/MEAL-AI
Catalog: MEAL AI/*.lproj/Localizable.strings
Languages: fi

# status.analyzing
source: Analyzing…
fi: Analysoidaan…

# error.prefix
source: Error:
fi: Virhe:

# image.none
source: No image selected
fi: Ei kuvaa valittuna

# results.title
source: Analysis Result
fi: Analyysin tulos

# btn.take_photo
source: Take Photo
fi: Ota kuva

# btn.analyze
source: Analyze
fi: Analysoi

# btn.analyzing
source: Analyzing…
fi: Analysoidaan…

# btn.pick
source: Choose
fi: Valitse

# btn.show_reasoning
source: Show AI reasoning
fi: Näytä AI‑päättely

# reasoning.title
source: AI reasoning
fi: AI‑päättely

# reasoning.per100
source: Nutrition per 100 g:
fi: Ravintoarvot 100 g kohti:

# a11y.clear
source: Clear analysis
fi: Tyhjennä analyysi

# a11y.run_shortcut
source: Run Shortcut
fi: Suorita Shortcut

# hint.title
source: Additional hint (optional)
fi: Lisävihje (valinnainen)

# hint.placeholder
source: e.g., “large plate, lots of rice, little sauce”
fi: esim. “iso lautanen, paljon riisiä, vähän kastiketta”

# settings.title
source: Settings
fi: Asetukset

# settings.general
source: General
fi: Yleiset

# settings.language
source: Language
fi: Kieli

# settings.quality
source: Quality
fi: Laatu

# settings.show_hint
source: Show hint field
fi: Näytä lisävihje‑kenttä

# settings.shortcuts
source: Shortcuts
fi: Pikakomennot

# settings.shortcut_enable
source: Enable Shortcut button
fi: Näytä Shortcuts‑nappi

# settings.shortcut_name_placeholder
source: Shortcut name (exact)
fi: Shortcutin nimi (tismalleen)

# settings.howto_header
source: Tips
fi: Vinkkejä

# settings.howto_photo
source: Tips for a good photo: shoot from above at 45–90°, include a size reference (fork/hand/packaging), good light, avoid motion blur. One dish per image works best.
fi: Hyvä kuva: ota ylhäältä 45–90°, mukaan mittakaava (haarukka/käsi/pakkaus), hyvä valo, vältä tärähdystä. Yksi annos/kuva toimii parhaiten.

# settings.hint_help
source: Hint field helps the model with context (e.g. portion size or hidden sauces).
fi: Lisävihje auttaa mallia kontekstissa (esim. annoskoko tai piilokastikkeet).

# shortcut.missing_name
source: Set a Shortcut name in Settings first.
fi: Määritä Shortcutin nimi Asetuksissa ensin.

# shortcut.invalid_url
source: Invalid Shortcuts URL.
fi: Virheellinen Shortcuts‑osoite.

# shortcut.failed_open
source: Shortcuts did not open. Ensure the shortcut exists and the name matches.
fi: Shortcuts ei avautunut. Varmista, että pikakuvake on olemassa ja nimi täsmää.
